/**
 * **************************************************
 *
 * @coding UTF-8
 *
 * @file class_info.h
 *
 * @author HDM
 *
 * @copyright HDM
 *
 * @date 2021/02/01 16:24:30
 *
 * @version 1.0
 *
 * @description 封装了适合本工程的班级类对象
 *
 * **************************************************
 */

#ifndef CLASS_INFO_H
#define CLASS_INFO_H

#include <iostream>


 // 行政班级号最大长度
#define MAXSIZE_CLASS_ID		6

// 专业名称最大长度
#define MAXSIZE_CLASS_MAJOR		24

/**
 * **************************************************
 *
 * @brief 类对象：行政班级信息
 *
 * **************************************************
 */
class class_info
{
public:

	/**
	 * **************************************************
	 *
	 * @brief 打印当前类所有非空成员变量，空格间隔，尾部回车
	 *
	 * @retval None
	 *
	 * **************************************************
	 */
	void print_info();

	/**
	 * **************************************************
	 *
	 * @brief 隶属行政班级号（唯一编号）（默认=nullptr）
	 *
	 * @details length: MAXSIZE_CLASS_ID
	 *
	 * **************************************************
	 */
	char* class_id = nullptr;

	/**
	 * **************************************************
	 *
	 * @brief 管理员名称（默认=nullptr）
	 *
	 * @details length:MAXSIZE_INPUT_USER_ID
	 *
	 * **************************************************
	 */
	char* class_admin = nullptr;

	/**
	 * **************************************************
	 *
	 * @brief 班级归属年级（默认=-1）
	 *
	 * **************************************************
	 */
	int class_grade = -1;

	/**
	 * **************************************************
	 *
	 * @brief 班级归属专业（默认=nullptr）
	 *
	 * @details length: MAXSIZE_CLASS_MAJOR
	 *
	 * **************************************************
	 */
	char* class_major = nullptr;

	/**
	 * **************************************************
	 *
	 * @brief 班级号（默认=-1）
	 *
	 * **************************************************
	 */
	int class_number = -1;
};

#endif
