/**
 * **************************************************
 *
 * @coding UTF-8
 *
 * @file exam_info.h
 *
 * @author HDM
 *
 * @copyright HDM
 *
 * @date 2021/02/02 00:36:58
 *
 * @version 1.0
 *
 * @description 封装了适合本工程的考试类对象
 *
 * **************************************************
 */

#ifndef EXAM_INFO_H
#define EXAM_INFO_H

#include <vector>
#include "exam_record_info.h"

#define MAXSIZE_DATETIME_LENGTH		12

class exam_info
{
public:

	/**
	 * **************************************************
	 *
	 * @brief print exam
	 *
	 * **************************************************
	 */
	void print_exam();

	/**
	 * **************************************************
	 *
	 * @brief 字符型：日期时间（默认=nullptr）
	 *
	 * **************************************************
	 */
	char* date_time = nullptr;

	/**
	 * **************************************************
	 *
	 * @brief 字符型：创建者（默认=nullptr）
	 *
	 * **************************************************
	 */
	char* admin = nullptr;

	/**
	 * **************************************************
	 *
	 * @brief 整型：考生人数（默认=0）
	 *
	 * **************************************************
	 */
	int count_student = 0;

	/**
	 * **************************************************
	 *
	 * @brief 浮点型：平均总成绩（默认=0）
	 *
	 * **************************************************
	 */
	double average_score = 0;

	/**
	 * **************************************************
	 *
	 * @brief 整型：应考科目数（默认=0）
	 *
	 * **************************************************
	 */
	int count_subject = 0;

	/**
	 * **************************************************
	 *
	 * @brief 字符容器：科目编号
	 *
	 * **************************************************
	 */
	std::vector<char*> vector_subject_serial_number;

	/**
	 * **************************************************
	 *
	 * @brief 浮点型容器：科目平均成绩
	 *
	 * **************************************************
	 */
	std::vector<double> vector_subject_average_score;

	/**
	 * **************************************************
	 *
	 * @brief 成绩记录类对象容器：考生记录
	 *
	 * **************************************************
	 */
	std::vector<exam_record_info*> vector_student_exam_record;
};

#endif
