/**
 * **************************************************
 *
 * @coding UTF-8
 *
 * @file exam_record_info.h
 *
 * @author HDM
 *
 * @copyright HDM
 *
 * @date 2021/02/02 00:55:46
 *
 * @version 1.0
 *
 * @description 封装了适合本工程的单条考生考试记录类对象
 *
 * **************************************************
 */

#ifndef EXAM_RECORD_INFO_H
#define EXAM_RECORD_INFO_H

#include <vector>
#include <iostream>
#include <iomanip>
#include "student_info.h"
#include "class_info.h"

#define DEFAULT_PRINT_WIDTH		8

class exam_record_info
{
public:

	/**
	 * **************************************************
	 *
	 * @brief print record
	 *
	 * **************************************************
	 */
	void print_record();

	/**
	 * **************************************************
	 *
	 * @brief 排名（默认=0）
	 *
	 * **************************************************
	 */
	int rankings = 0;

	/**
	 * **************************************************
	 *
	 * @brief 考生姓名（默认=nullptr）
	 *
	 * **************************************************
	 */
	char* student_name = nullptr;

	/**
	 * **************************************************
	 *
	 * @brief 考生所在行政班级号（默认=nullptr）
	 *
	 * **************************************************
	 */
	char* class_id = nullptr;

	/**
	 * **************************************************
	 *
	 * @brief 考生学号（默认=nullptr）
	 *
	 * **************************************************
	 */
	char* student_id = nullptr;

	/**
	 * **************************************************
	 *
	 * @brief 考生平均总成绩（默认=0）
	 *
	 * **************************************************
	 */
	double score_average = 0;

	/**
	 * **************************************************
	 *
	 * @brief 科目分数
	 *
	 * **************************************************
	 */
	std::vector<double> vector_score_subject;
};

#endif
